In [2]:
import sqlite3

def sql_i(instruction,data_b="data.db"):
    conn=sqlite3.connect(data_b)
    cur=conn.cursor()
    cur.execute(instruction)
    if "select" in instruction.lower() or "pragma" in instruction.lower():
        rows=cur.fetchall()
        conn.close()
        return(rows)
    else:
        conn.commit()  
        conn.close()

In [3]:
sql_i('''
create table PETRESCUE (
	ID INTEGER NOT NULL,
	ANIMAL VARCHAR(20),
	QUANTITY INTEGER,
	COST DECIMAL(6,2),
	RESCUEDATE DATE,
	PRIMARY KEY (ID)
	)
''')

# how to add columns names using tabulate function ?

In [4]:

head=[]
columns=sql_i("PRAGMA table_info('PETRESCUE')")
for name in columns:
     head.append(name[1])
head

['ID', 'ANIMAL', 'QUANTITY', 'COST', 'RESCUEDATE']

In [5]:
sql_i('''
insert into PETRESCUE values 
	(1,'Cat',9,450.09,'2018-05-29'),
	(2,'Dog',3,666.66,'2018-06-01'),
	(3,'Dog',1,100.00,'2018-06-04'),
	(4,'Parrot',2,50.00,'2018-06-04'),
	(5,'Dog',1,75.75,'2018-06-10'),
	(6,'Hamster',6,60.60,'2018-06-11'),
	(7,'Cat',1,44.44,'2018-06-11'),
	(8,'Goldfish',24,48.48,'2018-06-14'),
	(9,'Dog',2,222.22,'2018-06-15')
''')

In [6]:
import pandas as pd
PETRESCUE=sql_i("select * from PETRESCUE")
PETRESCUE=pd.DataFrame(PETRESCUE,columns=head)
PETRESCUE

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14
8   9       Dog         2  222.22  2018-06-15

# TASK 1:

In [ ]:
#Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table

In [ ]:
#Enter a function that calculates the total cost for  animals with respect to kind in the PETRESCUE table

In [ ]:
#Enter a function that displays the maximum quantity of animals rescued

In [ ]:
#Enter a function that displays the average cost of animals rescued

In [ ]:
#Enter a function that calculates the average cost for animals with respect to kind in the PETRESCUE table

In [ ]:
#calculalte cost per QUANTITY

In [ ]:
# Enter a function that displays the average cost of rescuing a dog.

In [ ]:
#calculalte cost per QUANTITY grouping by kind of the animal

In [ ]:
#Enter a function that displays the rounded cost of each rescue by using function ROUND()

In [ ]:
#Enter a function that displays the length of each animal name

In [ ]:
#Enter a function that displays the animal name in each rescue in uppercase

In [ ]:
#Enter a function that displays the animal name in each rescue in uppercase without duplications

In [ ]:
#Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats.
#Use cat in lower case in the query.